src/api/generate/xmdsBinding.SubmitLog.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns1="urn:xmds">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:SubmitLog>
   <serverKey></serverKey>
   <hardwareKey></hardwareKey>
   <logXml></logXml>
  </ns1:SubmitLog>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
