app/src/main/java/com/example/xibo/abc.kt

/*
<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:soapenc=\"http://schemas.xmlsoap.org/soap/encoding/\" xmlns:tns=\"urn:xmds\" xmlns:types=\"urn:xmds/encodedTypes\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body soap:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"><tns:RegisterDisplay><serverKey xsi:type=\"xsd:string\">${registerDisplayRequest.serverKey}</serverKey><hardwareKey xsi:type=\"xsd:string\">${registerDisplayRequest.hardwareKey}</hardwareKey><displayName xsi:type=\"xsd:string\">${registerDisplayRequest.displayName}</displayName><clientType xsi:type=\"xsd:string\">${registerDisplayRequest.clientType}</clientType><clientVersion xsi:type=\"xsd:string\">${registerDisplayRequest.clientVersion}</clientVersion><clientCode xsi:type=\"xsd:int\">$${registerDisplayRequest.clientCode}</clientCode><macAddress xsi:type=\"xsd:string\">${registerDisplayRequest.macAddress}</macAddress></tns:RegisterDisplay></soap:Body></soap:Envelope>*/
